//
//  Question.swift
//  Q&A
//
//  Created by Dennis Lin on 2021/5/30.
//

import Foundation


struct Question {
    var question: String
    var options: [String]
    var answer: String
    
    init(_ question: String, _ options: [String], _ answer: String) {
        self.question = question
        self.options = options
        self.answer = answer
    }
}


var historyQuestions: [Question] = [
    Question("從1952到1965年這段期間，日本是臺灣商品輸出最重要的國家，在這段時間內，臺灣輸往日本最重要的商品應該是下列何者？", ["機械設備", "塑化原料 ", "農產加工品", "紡織品"], "農產加工品"),
    Question("1895年馬關條約把台灣及其附屬島嶼割讓給日本，試問附屬島嶼是指何地？", ["釣魚台", "澎湖", "綠島", "蘭嶼"], "澎湖"),
    Question("先秦諸子百家中，哪一思想對秦國結束戰國時代、開創統一帝國的過程，發揮了相當大的作用？", ["墨家", "道家", "儒家", "法家"], "法家"),
    Question("第31屆夏季奧林匹克運動會，又稱2016年奧運會，由下列何座城市勝出？", ["日本東京", "美國芝加哥", "西班牙馬德里", "巴西里約熱內盧"], "巴西里約熱內盧"),
    Question("南美洲唯一個以葡萄牙語為官方語言的是？", ["秘魯" , "巴拉圭", "巴西", "阿根廷"], "巴西"),
    Question("泰姬瑪哈陵，是印度最知名的古蹟之一，是建立於哪個朝代？", ["洛迪王朝", "耶陀婆王朝", "馬拉地帝國", "蒙兀兒帝國"], "蒙兀兒帝國"),
    Question("南美洲輝煌的印地安文化最後被何民族消滅？", ["西班牙人", "葡萄牙人", "英國人", "美國人"], "西班牙人"),
    Question("臺灣銀行是在那一位總督任內成立的？", ["樺山資紀", "佐久間左馬太", "乃木希典", "兒玉源太郎"], "樺山資紀"),
    ]


var geographyQuestions: [Question] = [
    Question("美人魚銅像是哪一國家首都的地標？", ["美國紐約", "英國倫敦", "法國巴黎", "丹麥哥本哈根"], "丹麥哥本哈根"),
    Question("台灣哪一個原住民族，傳統上以當地的石材興建石板屋?", ["阿美族 ", "排灣族", "泰雅族", "鄒族"], "排灣族"),
    Question("台灣某個離島因地理環境擁有貝殼沙沙灘，素有「威尼斯沙灘」之稱是指哪裡？", ["澎湖", "小琉球", "蘭嶼", "綠島"], "小琉球"),
    Question("下列哪個國家主要經濟作物有葡萄、柑橘、橄欖、無花果等?", ["智利", "烏拉圭", "墨西哥", "玻利維亞"], "智利"),
    Question("澎湖四面環海，卻經常發生乾旱，嚴重時還需自臺灣本島船運民生用水的主要原因為何？", ["位背風側水氣不足", "熱帶地區蒸發旺盛", "地形帄坦不易成雨", "發展觀光消耗量"], "地形帄坦不易成雨"),
    Question("請問多瑙河的航運不如萊因河興盛的原因為何？", ["流經國家數量較少", "結冰期長", "流向和出海位置不佳", "河流含沙量多"], "流向和出海位置不佳"),
    Question("台灣除了墾丁國家公園之外，哪一個國家公園也擁有豐富的珊瑚礁生態資源?", ["太魯閣", "雪霸", "東沙", "金門"], "東沙"),
    Question("臺灣海岸線上也經常可見大量俗稱「肉粽角」的消波塊，隔開了海洋與陸地，請問放置於沿海地區的最主要功能為何？", ["增加泥沙淤積", "降低海浪侵蝕", "提供生物居所", "利於船隻航運"], "降低海浪侵蝕"),
]

var scienceQuestions: [Question] = [
    Question("下列何者不屬於類地行星？", ["水星", "金星", "火星", "土星"], "土星"),
    Question("下列何者非牛頓第三運動定律現象？", ["開槍射擊時，同時會有後座力", "起跑時，腳蹬起跑架，有利於起跑", "發射砲彈時，砲身向後退", "狗甩動身體，可將身上的水除去"], "狗甩動身體，可將身上的水除去"),
    Question("請問北極熊的毛與皮膚分別是何種顏色?", ["白色、膚色", "白色、黑色", "透明、膚色", "透明、黑色"], "透明、黑色"),
    Question("地震強度表示?", ["觀測點地表的震動大小", "震源的震動大小", "震源的能量大小", "觀測點所測得的地震能量大小"], "觀測點地表的震動大小"),
    Question("通常電力公司將電力由發電廠輸送到用戶的過程中，是採取何種方式輸送電力，以減少電力在長程輸送過程中的導線熱消耗？", ["高電流，低電壓", "高電流，高電壓", "低電流，高電壓", "低電流，低電壓"], "低電流，高電壓"),
    Question("在生物體內的化學變化都需要在下列何者的催化下反應？", ["礦物質", "核酸", "酶", "葡萄糖"], "酶"),
    Question("請問下列何種菜色在攝食時是食用它的「營養器官」？", ["「青椒」炒牛肉", "「番茄」炒蛋", "「蘿蔔」炒芹菜", "「玉米」濃湯"], "「蘿蔔」炒芹菜"),
    Question("落葉樹冬天的時候葉子會完全掉光，請問這個時候植物的葡萄糖養分從何處而來？", ["莖表皮細胞的光合作用", "植物本身的呼吸作用", "根部吸收土壤中的養分", "根、莖在夏天儲存的養分"], "根、莖在夏天儲存的養分"),
    Question("國際上用“K”表示含金量，18K表示含金量為？", ["99％", "82％", "75％", "18％"], "75％"),
]

var civicsQuestions: [Question] = [

    Question("美妝店喜歡打出「第二件半價」活動，促使消費者一次購買兩件。試問，此種消費行為乃受何種因素影響？", ["商品數量", "商品偏好", "商品價格", "預期心理"], "商品數量"),
    Question("如果有一個人以望遠鏡頭偷窺對面住家鄰居洗澡，試問此種行為最有可能觸犯何種法律？", ["刑事訴訟法", "刑法", "少年事件處理法", "社會秩序維護法"], "社會秩序維護法"),
    Question("從事何種買賣時，簽訂書面契約是較有保障的方式？", ["購買車票", "便利商店購物", "房屋買賣", "冰店買冰"], "房屋買賣"),
    Question("元元帶著與前夫所生的孩子與狀狀結婚，若狀狀願意不計前嫌的收養其子，那依「民法」而言，兩人之親屬關係為何？", ["擬制血親", "姻親", "旁系血親", "直系血親"], "姻親"),
    Question("「妯娌」為何種親屬關係？", ["血親的配偶 ", "血親的配偶的血親", "配偶的血親", "配偶的血親的配偶"], "配偶的血親的配偶"),
    Question("台灣是個民主社會，每個人都有權表達任何言論意見。此權利屬於哪項人民基本權利？", ["平等權", "自由權 ", "受益權", "參政權"], ")自由權"),
    Question("「科技始終來自於人性」為一著名廣告台詞，其強調消費者需求之何種因素？", ["個人偏好", "預期心理", "商品價格", "所得"], "個人偏好"),
    Question("買賣股票時，以每股20元買進，再以每股30元賣出。試問其投資報酬率是多少?", ["20﹪", "50﹪", "60﹪", "80﹪"], "50﹪"),
    
]

var healthQuestions: [Question] = [
    Question("下列何者並非「代謝症候群」的診斷指標 ？", ["腹部肥胖", "高密度膽固醇過高", "高血壓", "高血糖"], "高密度膽固醇過高"),
    Question("有關基礎代謝率的敘述，何者有誤？", ["是維持人體重要器官運作所需的最低熱量", "隨著年齡的增長有逐漸增加的趨勢", "英文縮寫為BMR", "一般二十五歲後，每十年約降2～5％"], "隨著年齡的增長有逐漸增加的趨勢"),
    Question("進行心肺復甦術時以「壓額提下巴法」來處理，是為了什麼目的？", ["暢通呼吸道", "檢查呼吸狀態", "測量大約體溫", "檢查有無意識"], "暢通呼吸道"),
    Question("防曬係數的數值若是30，代表什麼意義？", ["防曬的時間是30分鐘", "紫外線30以下時使用", "延緩皮膚被曬傷的時間增加30倍", "能保護全身皮膚百分之30"], "延緩皮膚被曬傷的時間增加30倍"),
    Question("若發生食品中毒，是因廚師的手不慎受傷，沒有確實戴手套。你認為是因為", ["感染了腸炎弧菌", "受到金黃色葡萄球菌感染", "因為廚師感冒了", "查不出原因"], "受到金黃色葡萄球菌感染"),
    Question("腦細胞不會再生，所以腦部缺氧超過幾分鐘，就會造成無法復原的損傷？", ["三分鐘", "五分鐘", "十分鐘", "十二分鐘"], "十分鐘"),
    Question("急性高山症通常在高地暴露多久發生？", ["5~10分鐘", "1~6小時", "1天", "3天"], "1~6小時"),
    Question("食物若暴露在危險溫度帶（5～60℃）下，會造成食品腐敗，因此不應放置超過多少小時？", ["6", "4", "3", "2"], "4"),
    Question("符合行政院衛生署對餐具檢測標準為陰性的項目中，何者可利用碘液檢測？", ["烷基苯磺酸鹽", "蛋白質", "脂質", "澱粉"], "澱粉"),
    Question("運動時，何者是決定以脂質作為主要能量來源的主要因素？", ["運動強度與持續時間", "飲食的成分", "體內能量的儲存量", "運動種類"], "運動強度與持續時間")
]
