//
//  Question.swift
//  Q&A
//
//  Created by Dennis Lin on 2021/5/30.
//

import Foundation


struct Question {
    var question: String
    var options: [String]
    var answer: String
    
    init(_ question: String, _ options: [String], _ answer: String) {
        self.question = question
        self.options = options
        self.answer = answer
    }
}


var questions: [Question] = [
    Question("撲克牌中唯一沒有鬍子的老K是哪一張？", ["梅花K", "方塊K", "紅心K", "黑桃K"], "紅心K"),
    Question("新台幣兩百元鈔票上的人物是下列何者？", ["孫中山", "蔣介石", "蔣經國" ,"鄭成功"] ,"蔣介石"),
    Question("英國旅遊網站票選全球十大怪異食物，請問下列哪一個台灣小吃曾登上第一名？", ["鴨血", "蚵仔煎", "臭豆腐", "豬血糕"], "豬血糕"),
    Question("巧克力是哪一國人發明的", ["墨西哥", "西班牙", "葡萄牙", "巴西"], "墨西哥"),
    Question("台灣的主力發電是以何種方式為主？", ["火力", "水力", "風力", "核能"], "火力"),
    Question("國際上用“K”表示含金量，18K表示含金量為？", ["99％", "82％", "75％", "18％"], "75％"),
    Question("有關台灣高鐵，下列哪一個縣市沒有停靠站？", ["新竹縣 ", "台南市", "嘉義縣", "彰化縣"], "彰化縣"),
    Question("美人魚銅像是哪一國家首都的地標？", ["美國紐約 ", "英國倫敦", "法國巴黎", "丹麥哥本哈根"], "丹麥哥本哈根"),
    Question("台灣哪一個原住民族，傳統上以當地的石材興建石板屋?", ["阿美族 ", "排灣族", "泰雅族", "鄒族"], "排灣族"),
    Question("台灣某個離島因地理環境擁有貝殼沙沙灘，素有「威尼斯沙灘」之稱是指哪裡？", ["澎湖", "小琉球", "蘭嶼", "綠島"], "小琉球"),
    Question("臺灣銀行是在那一位總督任內成立的？", ["樺山資紀", "佐久間左馬太", "乃木希典", "兒玉源太郎"], "樺山資紀"),
    Question("第31屆夏季奧林匹克運動會，又稱2016年奧運會，由下列何座城市勝出？", ["日本東京", "美國芝加哥", "西班牙馬德里", "巴西里約熱內盧"], "巴西里約熱內盧"),
    
    Question("南美洲唯一個以葡萄牙語為官方語言的是？", ["秘魯" , "巴拉圭", "巴西", "阿根廷"], "巴西"),
    
    Question("泰姬瑪哈陵，是印度最知名的古蹟之一，是建立於哪個朝代？", ["洛迪王朝", "耶陀婆王朝", "馬拉地帝國", "蒙兀兒帝國"], "蒙兀兒帝國"),
    
    Question("唐朝詩人，著有長恨歌描寫楊貴妃生平的是？", ["王維", "李商隱", "孟浩然", "白居易"], "白居易"),
    
    Question("足球所謂的PK為?", ["自由球", "間接自由球", "十二碼球", "球門球"], "十二碼球"),
    
    Question("食物若暴露在危險溫度帶（5～60℃）下，會造成食品腐敗，因此不應放置超過多少小時？", ["6小時", "4小時", "3小時", "2小時"], "4小時"),
    Question("運動時，何者是決定以脂質作為主要能量來源的主要因素？", ["運動強度與持續時間", "飲食的成分", "體內能量的儲存量", "運動種類"], "運動強度與持續時間"),
    
]


